In [1]:
import pandas as pd

In [2]:
first_df = pd.read_csv('data/전국_평균_분양가격(2013년_9월부터_2015년_8월까지).csv',encoding='cp949')

In [3]:
first_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17 entries, 0 to 16
Data columns (total 22 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   지역        17 non-null     object
 1   2013년12월  17 non-null     int64
 2   2014년1월   17 non-null     int64
 3   2014년2월   17 non-null     int64
 4   2014년3월   17 non-null     int64
 5   2014년4월   17 non-null     int64
 6   2014년5월   17 non-null     int64
 7   2014년6월   17 non-null     int64
 8   2014년7월   17 non-null     int64
 9   2014년8월   17 non-null     int64
 10  2014년9월   17 non-null     int64
 11  2014년10월  17 non-null     int64
 12  2014년11월  17 non-null     int64
 13  2014년12월  17 non-null     int64
 14  2015년1월   17 non-null     int64
 15  2015년2월   17 non-null     int64
 16  2015년3월   17 non-null     int64
 17  2015년4월   17 non-null     int64
 18  2015년5월   17 non-null     int64
 19  2015년6월   17 non-null     int64
 20  2015년7월   17 non-null     int64
 21  2015년8월   17 non-null     int64
dtypes: int64(21), object(1)
memory usage: 3.1+ KB

In [4]:
last_df = pd.read_csv('data/주택도시보증공사_전국_평균_분양가격(2019년_12월).csv',encoding='cp949')

In [5]:
last_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4335 entries, 0 to 4334
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   지역명      4335 non-null   object
 1   규모구분     4335 non-null   object
 2   연도       4335 non-null   int64
 3   월        4335 non-null   int64
 4   분양가격(㎡)  4058 non-null   object
dtypes: int64(2), object(3)
memory usage: 169.5+ KB

In [6]:
first_df.head(1)

,지역,2013년12월,2014년1월,2014년2월,2014년3월,2014년4월,2014년5월,2014년6월,2014년7월,2014년8월,...,2014년11월,2014년12월,2015년1월,2015년2월,2015년3월,2015년4월,2015년5월,2015년6월,2015년7월,2015년8월
0,서울,18189,17925,17925,18016,18098,19446,18867,18742,19274,...,20242,20269,20670,20670,19415,18842,18367,18374,18152,18443

In [7]:
last_df.head(1)

  지역명 규모구분    연도   월 분양가격(㎡)
0  서울   전체  2015  10    5841

In [8]:
#last_df nan 값이 컬럼별로 몇개가 있는지 확인

In [9]:
last_df.isna().sum()

지역명          0
규모구분         0
연도           0
월            0
분양가격(㎡)    277
dtype: int64

In [10]:
#last_df의 분양가격의 합과 평균을 구하세요

In [11]:
last_df

     지역명               규모구분    연도   월 분양가격(㎡)
0     서울                 전체  2015  10    5841
1     서울         전용면적 60㎡이하  2015  10    5652
2     서울   전용면적 60㎡초과 85㎡이하  2015  10    5882
3     서울  전용면적 85㎡초과 102㎡이하  2015  10    5721
4     서울        전용면적 102㎡초과  2015  10    5879
...   ..                ...   ...  ..     ...
4330  제주                 전체  2019  12    3882
4331  제주         전용면적 60㎡이하  2019  12     NaN
4332  제주   전용면적 60㎡초과 85㎡이하  2019  12    3898
4333  제주  전용면적 85㎡초과 102㎡이하  2019  12     NaN
4334  제주        전용면적 102㎡초과  2019  12    3601

[4335 rows x 5 columns]

In [12]:
print(last_df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4335 entries, 0 to 4334
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   지역명      4335 non-null   object
 1   규모구분     4335 non-null   object
 2   연도       4335 non-null   int64
 3   월        4335 non-null   int64
 4   분양가격(㎡)  4058 non-null   object
dtypes: int64(2), object(3)
memory usage: 169.5+ KB
None

In [13]:
print(last_df['분양가격(㎡)'].info())

<class 'pandas.core.series.Series'>
RangeIndex: 4335 entries, 0 to 4334
Series name: 분양가격(㎡)
Non-Null Count  Dtype
--------------  -----
4058 non-null   object
dtypes: object(1)
memory usage: 34.0+ KB
None

In [14]:
last_df['분양가격'] = pd.to_numeric(last_df['분양가격(㎡)'],errors='coerce') #문제가 있는 값은 NaN으로 전환
print(last_df['분양가격'].dtype)
print(last_df['분양가격'].sum(skipna=True))
print(last_df['분양가격'].mean(skipna=True))

float64
12813275.0
3238.128632802628

In [15]:
#2013~2015년 데이터는 평당 분양가격입니다. 2015~2019는 m^2당 분양가격입니다.
#2015~2019년 데이터를 평당분양가격으로 변경(컬럼 '평당분양가격'을 생성하고 넣어줍니다.)

In [16]:
last_df['평당분양가격'] = last_df['분양가격']*3.3

In [17]:
last_df.head(2)

  지역명        규모구분    연도   월 분양가격(㎡)    분양가격   평당분양가격
0  서울          전체  2015  10    5841  5841.0  19275.3
1  서울  전용면적 60㎡이하  2015  10    5652  5652.0  18651.6

In [18]:
#'규모구분'에 몇가지 종류의 값이 있는지 확인
print(last_df['규모구분'].nunique())
print(last_df['규모구분'].unique())

5
['전체' '전용면적 60㎡이하' '전용면적 60㎡초과 85㎡이하' '전용면적 85㎡초과 102㎡이하' '전용면적 102㎡초과']

In [19]:
#'규모구분'의 내용을 60m^2, 60m^2~85m^2, 85m^2~102m^2, 102m^2~ 로 변경해서 '전용면적'컬럼에 넣으세요

In [20]:
last_df['전용면적']=last_df['규모구분'].str.replace('이하','').str.replace('초과','~').str.replace('전용면적','').str.replace(' ','').str.strip()

In [21]:
print(last_df)

     지역명               규모구분    연도   월 분양가격(㎡)    분양가격   평당분양가격      전용면적
0     서울                 전체  2015  10    5841  5841.0  19275.3        전체
1     서울         전용면적 60㎡이하  2015  10    5652  5652.0  18651.6       60㎡
2     서울   전용면적 60㎡초과 85㎡이하  2015  10    5882  5882.0  19410.6   60㎡~85㎡
3     서울  전용면적 85㎡초과 102㎡이하  2015  10    5721  5721.0  18879.3  85㎡~102㎡
4     서울        전용면적 102㎡초과  2015  10    5879  5879.0  19400.7     102㎡~
...   ..                ...   ...  ..     ...     ...      ...       ...
4330  제주                 전체  2019  12    3882  3882.0  12810.6        전체
4331  제주         전용면적 60㎡이하  2019  12     NaN     NaN      NaN       60㎡
4332  제주   전용면적 60㎡초과 85㎡이하  2019  12    3898  3898.0  12863.4   60㎡~85㎡
4333  제주  전용면적 85㎡초과 102㎡이하  2019  12     NaN     NaN      NaN  85㎡~102㎡
4334  제주        전용면적 102㎡초과  2019  12    3601  3601.0  11883.3     102㎡~

[4335 rows x 8 columns]

In [22]:
#필요없는 컬럼('규모구분','분양가격(㎡)')를 제거합니다.

In [23]:
last_df = last_df.drop('분양가격(㎡)',axis=1).drop('규모구분',axis=1)

In [24]:
last_df

     지역명    연도   월    분양가격   평당분양가격      전용면적
0     서울  2015  10  5841.0  19275.3        전체
1     서울  2015  10  5652.0  18651.6       60㎡
2     서울  2015  10  5882.0  19410.6   60㎡~85㎡
3     서울  2015  10  5721.0  18879.3  85㎡~102㎡
4     서울  2015  10  5879.0  19400.7     102㎡~
...   ..   ...  ..     ...      ...       ...
4330  제주  2019  12  3882.0  12810.6        전체
4331  제주  2019  12     NaN      NaN       60㎡
4332  제주  2019  12  3898.0  12863.4   60㎡~85㎡
4333  제주  2019  12     NaN      NaN  85㎡~102㎡
4334  제주  2019  12  3601.0  11883.3     102㎡~

[4335 rows x 6 columns]